doc/s-sql-n.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:56 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples N</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples N</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga067349">S-SQL Examples Home Page</a></li>
<li><a href="#null">Null</a></li>
<li><a href="#not-null">Not-Null</a></li>
<li><a href="#nullif">Nullif</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orga067349" class="outline-2">
<h2 id="orga067349"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-orga067349">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-null" class="outline-2">
<h2 id="null">Null</h2>
<div class="outline-text-2" id="text-null">
<p>
I have a few "groups of countries" in a countries table that should not have a latitude such as the EU. As a result so I would expect to be able to find them by looking for records with null in the latitude field. The second example is similar, looking for any countries with either a null latitude or null longitude. In my particular database, the only "country" matching that is the EU.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:is-null</span> 'latitude)))

((6 <span class="org-string">"EU"</span>))

(query (<span class="org-builtin">:select</span> 'name <span class="org-builtin">:from</span> 'countries
        <span class="org-builtin">:where</span> (<span class="org-builtin">:or</span> (<span class="org-builtin">:is-null</span> 'latitude)
                    (<span class="org-builtin">:is-null</span> 'longitude))))

((<span class="org-string">"EU"</span>))
</pre>
</div>


<p>
The next gives the number of records (without using the sql count operator) from countries where the currency field was both not null and did not consist of just a blank string.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(length
 (query (<span class="org-builtin">:select</span> 'id
         <span class="org-builtin">:from</span> 'countries
         <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:not</span> (<span class="org-builtin">:=</span> <span class="org-string">""</span> 'countries.currency))
                      (<span class="org-builtin">:not</span> (<span class="org-builtin">:is-null</span> 'countries.currency))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-not-null" class="outline-2">
<h2 id="not-null">Not-Null</h2>
<div class="outline-text-2" id="text-not-null">
<p>
Similarly, you can use :not-null
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'ta <span class="org-builtin">:from</span> 'a <span class="org-builtin">:where</span> (<span class="org-builtin">:not-null</span> 'ta)))
</pre>
</div>
</div>
</div>

<div id="outline-container-nullif" class="outline-2">
<h2 id="nullif">Nullif</h2>
<div class="outline-text-2" id="text-nullif">
<p>
Suppose you want to perform division, but do not know if the divisor could be zero. The following will handle that and return 0 in that case.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((divisor 3))
  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:coalesce</span> (<span class="org-builtin">:/</span> 12 (<span class="org-builtin">:nullif</span> divisor 0 )) 0))
         <span class="org-builtin">:single</span>))

(<span class="org-keyword">let</span> ((divisor 0))
  (query (<span class="org-builtin">:select</span> (<span class="org-builtin">:coalesce</span> (<span class="org-builtin">:/</span> 12 (<span class="org-builtin">:nullif</span> divisor 0 )) 0))
         <span class="org-builtin">:single</span>))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>